---
kind: other
id: Methods.T:Autodesk.Revit.DB.Lighting.SphericalLightDistribution
source: html/1af90437-97cf-9c37-edc1-e073034a0a89.htm
---
# SphericalLightDistribution Methods

Creates a copy of the LightDistribution derived object.